/*******************************************************************************
* タイトル:		スコアアニメーション制御ヘッダー
* プログラム名:	resultscore.h
* 作成者:		大槻海斗
* 作成日:		2024/08/29〜
* 更新日		2024/08/29
*******************************************************************************/

#ifndef _RSCORE_H_
#define _RSCORE_H_

/*******************************************************************************
*　プロトタイプ宣言
*******************************************************************************/

void InitRScore(void);
void UpdateRScore(void);
void DrawRScore(void);
void UninitRScore(void);


#endif
