/*******************************************************************************
* タイトル:		攻撃クラス
* プログラム名:	Attack.cpp
* 作成者:		大槻　海斗
* 作成日:		2024/12/09 ～
* 最終変更日:	2024/12/09
********************************************************************************/

/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "stdafx.h"
#include "Attack.h"
#include "World.h"

/*******************************************************************************
* グローバル変数
********************************************************************************/
Float2 g_PlayerPos;

/*******************************************************************************
* 更新処理
********************************************************************************/
void Attack::Update()
{

	g_PlayerPos = GetLocation();

	//移動させて調整
	g_PlayerPos.x -= 50.0f;

	//攻撃範囲にGameObjectがいるか？
	GameObjects objects = GetWorld()->GetGameObjects({ g_PlayerPos,32 });

	//GameObjectが"PLAYER"タグでなかったら攻撃を加える
	for (auto it : objects) {
		if (it->GetTag() == "PLAYER") { continue; }
		it->Damage(1);
	}

	static const double ATTACK_TIME = 1.0;

	//1秒経過後削除
	if (Scene::Time() - m_AttackTime >= ATTACK_TIME) {
		//すぐ消える
		SetDestroy(true);
	}

}

/*******************************************************************************
* 描画処理
********************************************************************************/
void Attack::Draw() const
{
	TextureAsset(U"Attack").drawAt(g_PlayerPos, Palette::White);
}
