/*******************************************************************************
* タイトル:		攻撃クラス
* プログラム名:	Attack.h
* 作成者:		大槻　海斗
* 作成日:		2024/12/09 ～
* 最終変更日:	2024/12/09
********************************************************************************/

#ifndef ATTACK_H
#define ATTACK_H

/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "GameObject.h"

/*******************************************************************************
* 攻撃クラス
********************************************************************************/
class Attack : public GameObject
{
private:
	double m_AttackTime = Scene::Time();

public:

	Attack(const Float2& location) : GameObject("ATTACK", location) {}
	Attack() : Attack({ 0.0f,0.0f }) {};


	void Update() override;
	void Draw() const override;

};

#endif // ATTACK_H

