/*******************************************************************************
* タイトル:		バットクラス
* プログラム名:	Attack_Bat.h
* 作成者:		大槻　海斗
* 作成日:		2025/01/24 ～
* 最終変更日:	2025/01/24
********************************************************************************/
#pragma once
/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "GameObject.h"

/*******************************************************************************
* 攻撃クラス
********************************************************************************/
class Attack_Bat : public GameObject
{
private:
	double m_AttackTime = Scene::Time();
	const Texture m_texture{ U"asset/バット.png" };
	float m_angle = 20.0f;
	int m_freamCounter = 0;

public:

	Attack_Bat(const Float2& location);
	Attack_Bat() : Attack_Bat({ 0.0f,0.0f }) {};


	void Update() override;
	void Draw() const override;

};



