/*******************************************************************************
* タイトル:		回復エフェクトクラス
* プログラム名:	Effect_Heal.cpp
* 作成者:		大槻　海斗
* 作成日:		2025/01/24 ～
* 最終変更日:	2025/01/24
********************************************************************************/

/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "stdafx.h"
#include "Effect_Heal.h"
#include "World.h"

Effect_Heal::Effect_Heal(const Float2& location)
	: GameObject("EFFECT_HEAL", location)
{

}

/*******************************************************************************
* 更新処理
********************************************************************************/
void Effect_Heal::Update()
{
	static const double ATTACK_TIME = 1.0;

	//1秒経過後削除
	if (Scene::Time() - m_AttackTime >= ATTACK_TIME) {
		//すぐ消える
		SetDestroy(true);
	}
}

/*******************************************************************************
* 描画処理
********************************************************************************/
void Effect_Heal::Draw() const
{
	m_texture.resized({ m_texture.size().x * 0.75,m_texture.size().y * 0.75 }).drawAt(GetLocation());
}
