/*******************************************************************************
* タイトル:		回復エフェクトクラス
* プログラム名:	Effect_Heal.h
* 作成者:		大槻　海斗
* 作成日:		2025/01/24 ～
* 最終変更日:	2025/01/24
********************************************************************************/
#pragma once
/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "GameObject.h"

/*******************************************************************************
* 攻撃クラス
********************************************************************************/
class Effect_Heal : public GameObject
{
private:
	const Texture m_texture{ U"asset/回復マーク.png" };
	double m_AttackTime = Scene::Time();

public:

	Effect_Heal(const Float2& location);
	Effect_Heal() : Effect_Heal({ 0.0f,0.0f }) {};


	void Update() override;
	void Draw() const override;

};
#pragma once
