/*******************************************************************************
* タイトル:		警戒してチェイスする敵のスポナークラス
* プログラム名: EnemySpawnerPatrolChaser.h
* 作成者:		大槻　海斗
* 作成日:		2025/02/10 ～
* 最終変更日:	2025/02/10
********************************************************************************/

/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "stdafx.h"
#include "EnemySpawnerPatrolChaser.h"
#include "World.h"
#include "EnemyPatrolChaser.h"

/*******************************************************************************
* 更新処理
********************************************************************************/
void EnemySpawnerPatrolChaser::Update()
{
	static const double SPAWN_TIME_SPAN = 1.0;

	//世界に敵が5匹以上いたらスポーンしない
	if (GetWorld()->GetGameObjects("ENEMY").size() >= 5) {
		return;
	}

	//時間計測して時間がたってたら敵を生成する
	if (Scene::Time() - m_SpawnTime > SPAWN_TIME_SPAN) {

		//敵をワールドへ登録する(敵の初期座標はスポナーの座標から算出)
		GetWorld()->Register(new EnemyPatrolChaser(m_PatrolPoints));

		m_SpawnTime = Scene::Time();	//スポーンした時間を記録
	}


}
