/*******************************************************************************
* タイトル:		敵スポナークラス
* プログラム名:	EnemySpawner.h
* 作成者:		大槻　海斗
* 作成日:		2024/12/02 ～
* 最終変更日:	2024/12/09
********************************************************************************/

/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "stdafx.h"
#include "EnemySpawner.h"
#include "World.h"
#include "Enemy.h"

/*******************************************************************************
* 更新処理
********************************************************************************/
void EnemySpawner::Update()
{
	static const double SPAWN_TIME_SPAN = 1.0;

	//世界に敵が5匹以上いたらスポーンしない
	if (GetWorld()->GetGameObjects("ENEMY").size() >= 5) {
		return;
	}

	//時間計測して時間がたってたら敵を生成する
	if (Scene::Time() - m_SpawnTime > SPAWN_TIME_SPAN){

		//敵をワールドへ登録する(敵の初期座標はスポナーの座標から算出)
		GetWorld()->Register(new Enemy(GetLocation()));

		m_SpawnTime = Scene::Time();	//スポーンした時間を記録
	}

}

/*******************************************************************************
* 描画処理
********************************************************************************/
void EnemySpawner::Draw() const
{
	m_Texture.drawAt(GetLocation(), Palette::Red);
}
