/*******************************************************************************
* タイトル:		スピードブースタークラス
* プログラム名:	Item_Speeder.h
* 作成者:		大槻　海斗
* 作成日:		2025/01/24 ～
* 最終変更日:	2025/01/24
********************************************************************************/
#pragma once


/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "GameObject.h"

/*******************************************************************************
* 攻撃クラス
********************************************************************************/
class Item_Speeder : public GameObject
{
private:
	const Texture m_texture{ U"asset/靴.png" };
public:

	Item_Speeder(const Float2& location);
	Item_Speeder() : Item_Speeder({ 0.0f,0.0f }) {};


	void Update() override;
	void Draw() const override;

};
