/*******************************************************************************
* タイトル:		回復アイテムクラス
* プログラム名:	Item_Heal.h
* 作成者:		大槻　海斗
* 作成日:		2025/01/24 ～
* 最終変更日:	2025/01/24
********************************************************************************/
#pragma once


/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "GameObject.h"

/*******************************************************************************
* 攻撃クラス
********************************************************************************/
class Item_Heal : public GameObject
{
private:
	const Texture m_texture{ U"asset/回復ポーション.png"};
public:

	Item_Heal(const Float2& location);
	Item_Heal() : Item_Heal({ 0.0f,0.0f }) {};


	void Update() override;
	void Draw() const override;

};
