/*******************************************************************************
* タイトル:		HPゲージクラス
* プログラム名:	UI_HP.h
* 作成者:		大槻　海斗
* 作成日:		2025/01/29 ～
* 最終変更日:	2025/01/29
********************************************************************************/
#pragma once
/*******************************************************************************
* インクルードファイル
********************************************************************************/
#include "GameObject.h"

/*******************************************************************************
* 攻撃クラス
********************************************************************************/
class UI_HP : public GameObject
{
private:
	const Texture m_texture01{ U"asset/HPゲージ.png" };
	const Texture m_texture02{ U"asset/HPゲージ枠.png" };

	float m_adjustSize = 0;
	float m_adjustPos = 0.0f;

public:

	UI_HP(const Float2& location);
	UI_HP() : UI_HP({ 0.0f,0.0f }) {};


	void Update() override;
	void Draw() const override;

};
#pragma once
