/*******************************************************************************
* タイトル:		バトルヘッダー
* プログラム名:	Battle.h
* 作成者:		大槻　海斗
* 作成日:		2024/09/06 〜
* 最終変更日:	2024/09/06
********************************************************************************/

#ifndef _BATTLE_H_
#define _BATTLE_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "Character.h"

/*******************************************************************************
* クラス定義
*******************************************************************************/
//バトルクラス
class Battle
{
private:
	Character* m_Fighters[2];

public:
	Battle(Character* pFighterA, Character* pFighterB);
	~Battle() {};

	Character* CharacterFactory(int type, int i);
	void Fight();
};

#endif	//_BATTLE_H_
