/*******************************************************************************
* タイトル:		メニューヘッダー
* プログラム名:	Menu.h
* 作成者:		大槻　海斗
* 作成日:		2024/07/10 〜
* 最終変更日:	2024/07/16
********************************************************************************/
#ifndef _MENU_H_
#define _MENU_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "Character.h"
#include "Guild.h"
#include <string>


/*******************************************************************************
* クラス定義
*******************************************************************************/
//メニュークラス
class Menu
{
private:

	//プロローグ
	void Prologue();

public:
	Menu();		//コンストラクタ
	~Menu();	//デストラクタ

	//ギルドメンバーの追加
	void AddGuildMember();

	//ギルドメンバーの閲覧
	void ViewGuildMember();

	//ギルドメンバーの削除
	void DeleteGuildMember();

	//ギルドメンバーの並び替え
	void SortGuildMember();

	void StartBattle();

	//セーブ
	void Save();

	//ロード
	void Load();
};


#endif //MENU_H