/*******************************************************************************
* タイトル:		ボールショット
* プログラム名:	ball_shot.h
* 作成者:		大槻　海斗
* 作成日:		2024/12/10 〜
* 最終変更日:	2024/12/10
********************************************************************************/
#ifndef BallShot_H
#define BallShot_H

/*******************************************************************************
* インクルード
*******************************************************************************/
#include "Ball.h"
#include "renderer.h"

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitBallShot();
void UninitBallShot();
void SetBallShot(Ball* pBall);
void SetBallShotMatrix(const XMMATRIX& matrix);
void UpdateBallShot();
void DrawBallShot();
const XMVECTOR& GetBallShotVelocity();

#endif	//BallShot_H
