/*******************************************************************************
* タイトル:		ビルボード
* プログラム名:	billboard.h
* 作成者:		大槻　海斗
* 作成日:		2024/12/17 〜
* 最終変更日:	2024/12/17
********************************************************************************/
#pragma once
/*******************************************************************************
* インクルード
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitBillboard(void);
void UninitBillboard(void);

void DrawBillboard(int textureId, const XMFLOAT2& offset, const XMVECTOR& position, const XMFLOAT2& scale, float angle,
	float tx, float ty, float tw, float th);

void CalculateBillboardMatrix(const XMMATRIX& mtxView);




