/*******************************************************************************
* タイトル:		ゲームシーンメイン処理
* プログラム名:	Game_Main.h
* 作成者:		大槻　海斗
* 作成日:		2024/12/20 〜
* 最終変更日:	2025/01/10
********************************************************************************/
#pragma once

#include "ball.h"

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitGameMain(void);
void UpdateGameMain(void);
void DrawGameMain(void);
void UninitGameMain(void);

Ball* GetBallPointer();