/*******************************************************************************
* タイトル:		ライトの管理
* プログラム名:	light.h
* 作成者:		大槻　海斗
* 作成日:		2024/11/12 〜
* 最終変更日:	2024/11/12
********************************************************************************/

#ifndef LIGHT_H
#define LIGHT_H
/*******************************************************************************
* インクルード
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitLight(void);
void UninitLight(void);


void SetDirectionalLight(const XMVECTOR& wolrdLightDir, const XMFLOAT4& color);
void SetAmbientColor(const XMFLOAT4& color);

// ライトの設定
// 
// 引数
// world ... ライティング対象のワールド変換行列
//
void SetLight(const XMMATRIX& world);


#endif	//LIGHT_H


