/*******************************************************************************
* タイトル:		シーン管理ヘッダー
* プログラム名:	Scene_Manager.h
* 作成者:		大槻海斗
* 作成日:		2024/09/05〜
* 更新日		2024/09/05
*******************************************************************************/
#pragma once

class Time;

/*******************************************************************************
*　列挙体定義
*******************************************************************************/
//シーン番号
enum SCENE
{
	SCENE_NONE = 0,	//何も実行しない
	SCENE_TITLE,
	SCENE_GAME,
	SCENE_RESULT,
	SCENE_MAX
};

/*******************************************************************************
*　プロトタイプ宣言
*******************************************************************************/
void InitManager();
void UninitManager();
void UpdateManager();
void DrawManager();

SCENE GetScene(void);
void SetScene(SCENE scene);	//シーン切替

void SetTime(const Time* time);
Time GetTime();


