/*******************************************************************************
* タイトル:		ゲームシーン処理ヘッダー
* プログラム名:	Scene_Game.h
* 作成者:		大槻　海斗
* 作成日:		2024/09/04 〜
* 最終変更日:	2024/09/04
********************************************************************************/
#pragma once
/*******************************************************************************
*　列挙体定義
*******************************************************************************/
//シーン番号
enum GAMESCENE
{
	GAME_NONE = 0,	//何も実行しない
	GAME_COUNTDOWN,	//スタート前のカウントダウンのシーン
	GAME_MAIN,		//ゲームを遊ぶメインのシーン
	GAME_FINISH,	//ゲームが終了し、リザルトシーンへ移行するシーン
	GAME_RESTART,
	GAME_MAX
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitGame(void);
void UpdateGame(void);
void DrawGame(void);
void UninitGame(void);

GAMESCENE GetGameScene(void);
void SetGameScene(GAMESCENE scene);	//シーン切替

