/*******************************************************************************
* タイトル:		UI制御
* プログラム名:	UI_Manager.cpp
* 作成者:		大槻海斗
* 作成日:		2024/12/21〜
* 更新日		2024/12/21
*******************************************************************************/

/*******************************************************************************
*　インクルードファイル
*******************************************************************************/
#include "UI_Manager.h"
#include "texture.h"
//UI一覧ヘッダー
#include "UI_score.h"
#include "UI_pause.h"
#include "UI_time.h"

/*******************************************************************************
*　初期化処理
*******************************************************************************/
void UI_Manager::Init()
{
	m_score = new Score();
	m_score->Init();

	m_pause = new Pause();
	m_pause->Init();

	m_time = new Time();
	m_time->Init();

}

/*******************************************************************************
*　終了処理
*******************************************************************************/
void UI_Manager::Uninit()
{
	if (m_time) {
		m_time->Uninit();
		delete m_time;
		m_time = nullptr;
	}

	if (m_pause) {
		m_pause->Uninit();
		delete m_pause;
		m_pause = nullptr;
	}

	if (m_score) {
		m_score->Uninit();
		delete m_score;
		m_score = nullptr;
	}
}

/*******************************************************************************
*　更新処理
*******************************************************************************/
void UI_Manager::Update()
{
	m_score->Update();
	m_time->Update();


	//ポーズはシーン遷移をするため、絶対に一番下
	m_pause->Update();
}

/*******************************************************************************
*　描画処理
*******************************************************************************/
void UI_Manager::Draw() const
{
	m_score->Draw();
	m_pause->Draw();
	m_time->Draw();
}
