/*******************************************************************************
* タイトル:		ポーズ画面
* プログラム名:	UI_pause.h
* 作成者:		大槻　海斗
* 作成日:		2025/01/12 〜
* 最終変更日:	2025/01/12
********************************************************************************/
#pragma once
/*******************************************************************************
*　インクルードファイル
*******************************************************************************/
#include "UI.h"
#include "picture.h"

/*******************************************************************************
* クラス定義
*******************************************************************************/
class Pause : public UI
{
private:

	bool m_isPause = false;
	Picture* m_pausePicture[8] = {nullptr};
	int m_choiceNum = 0;

public:

	Pause() = default;

	void Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

	//ポーズ切替
	bool ChangePause();
	bool GetPause();
};
