/*******************************************************************************
* タイトル:		時間アニメーション制御ヘッダー
* プログラム名:	UI_resultTime.h
* 作成者:		大槻海斗
* 作成日:		2025/01/13〜
* 更新日		2025/01/13
*******************************************************************************/

#pragma once
/********************************************************************************
* インクルードファイル
********************************************************************************/
#include "UI.h"

/*******************************************************************************
* クラス定義
*******************************************************************************/
class Result_Time : public UI
{
private:
	int m_minute = 0;
	int m_second = 0;
	int m_millisecond = 0;

public:
	Result_Time() = default;

	void Init() override;
	void Uninit() override;
	void Update() override;
	void Draw() override;

	void SetValue(int min, int sec, int milsec) {
		m_minute = min;
		m_second = sec;
		m_millisecond = milsec;
	}


};




