/*******************************************************************************
* タイトル:		バックグラウンドクラス
* プログラム名:	BG.cpp
* 作成者:		大槻海斗
* 作成日:		2024/06/10〜
* 更新日		2024/07/08
********************************************************************************/

/*******************************************************************************
*　インクルードファイル
*******************************************************************************/
#include "BG.h"

BG::BG()
{
	pos = XMFLOAT3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0.0f);
	size = XMFLOAT2(SCREEN_WIDTH, SCREEN_HEIGHT);
	col = XMFLOAT4(1.0f, 1.0f, 1.0f, 1.0f);
	use = true;
	TextureID = NULL;
}

BG::~BG()
{
	if (TextureID == nullptr)
		return;

	TextureID->Release();	//テクスチャの解放
}
