/*******************************************************************************
* タイトル:		フィールド・マップチップ制御
* プログラム名:	block.h
* 作成者:		大槻海斗
* 作成日:		2024/09/04〜
* 更新日		2024/09/04
*******************************************************************************/

#ifndef _BLOCK_H_
#define _BLOCK_H_

/*******************************************************************************
*　マクロ定義
*******************************************************************************/
#define BLOCK_MAX (100)		//最大ブロック数
#define BLOCK_WIDTH (50.0f)	//ブロックの幅
#define BLOCK_HIGHT (50.0f)	//ブロックの高さ
#define BLOCK_NUM_X (6)	//横に連なるブロック数
#define BLOCK_NUM_Y (13)	//縦に連なるブロック数
#define BLOCK_TYPE_MAX (4)	//ブロックの種類数
#define TIME_DELAY (60)		//待ち時間


/*******************************************************************************
*　列挙体定義
*******************************************************************************/

enum BLOCK_STATE
{
	BLOCK_STATE_IDLE = 0,	//何もしない
	BLOCK_STATE_ERASE_IDLE,	//消滅中
	BLOCK_STATE_STACK_IDLE,	//落下中
};

/*******************************************************************************
*　クラス定義
*******************************************************************************/
class BLOCK
{
public:
	bool Enable;	//ここにブロックがあるか無いか
	bool Erase;		//このブロックは消滅するか
	int Type;		//種類
};


/*******************************************************************************
*　プロトタイプ宣言
*******************************************************************************/
void InitBlock();
void UninitBlock();
void UpdateBlock();
void DrawBlock();

//配列にブロック番号をセット
void SetBlock(int x, int y, int type);

//配列の情報を取得
BLOCK GetBlock(int x, int y);

//ブロック消去処理
void EraseBlock();

//ブロック落下処理
void StackBlock();

//消せるかチェック
void EraseBlocks(int count, int x, int y, bool& erase,
	bool isVertical, bool isEnd, int combo, int type);

#endif // !_BLOCK_H_

