/*******************************************************************************
* タイトル:		フェード制御ヘッダー
* プログラム名:	fade.h
* 作成者:		大槻海斗
* 作成日:		2024/09/11〜
* 更新日		2024/09/11
********************************************************************************/

#ifndef _FADE_H_
#define _FADE_H_

/*******************************************************************************
*　インクルードファイル
*******************************************************************************/
#include "main.h"
#include "manager.h"

/*******************************************************************************
*　列挙隊定義
*******************************************************************************/
enum FADE_STATE {
	FADE_NONE = 0,	//何もしない
	FADE_IN,		//フェードアウト実行
	FADE_OUT,		//フェードイン実行
	FADE_MAX
};

/*******************************************************************************
*　クラス定義
*******************************************************************************/
// フェード構造体
class FADE {

public:

	//デストラクタ
	~FADE();

	//プロトタイプ宣言
	void InitFade(void);
	void UpdateFade(void);
	void DrawFade(void);
	void StartFade(FADE_STATE state);
	FADE_STATE GetFadeState();

	//変数
	FADE_STATE mode;	// 現在のフェードモード
	XMFLOAT3 pos;	// 座標
	XMFLOAT2 size;	// サイズ
	XMFLOAT4 col;
	int frame;
	bool use;		// 使用フラグ
	ID3D11ShaderResourceView* TextureID;	//テクスチャ

};

/*******************************************************************************
*　プロトタイプ宣言
*******************************************************************************/


#endif
