/*******************************************************************************
* タイトル:		プレイヤー制御
* プログラム名:	player.h
* 作成者:		大槻海斗
* 作成日:		2024/09/04〜
* 更新日		2024/09/04
*******************************************************************************/

#ifndef _PLAYER_H_
#define _PLAYER_H_

/*******************************************************************************
*　インクルードファイル
*******************************************************************************/
#include "main.h"
#include "sprite.h"

/*******************************************************************************
*　列挙体定義
*******************************************************************************/
//プレイヤーステータス
enum PLAYER_STATE
{
	PLAYER_STATE_IDLE = 0,	//何もしない
	PLAYER_STATE_MOVE,		//移動中
	PLAYER_STATE_GROUND_IDLE,//着地中
	PLAYER_STATE_MISS_IDLE	//ミス発生中
};

/*******************************************************************************
*　クラス定義
*******************************************************************************/
class PLAYER
{
public:
	XMFLOAT2	pos;	//表示座標
	XMFLOAT2	newPos;	//1フレーム先の座標
	XMFLOAT2	vel;	//加速度
	int			Type[3];//ブロック種類
};

/*******************************************************************************
*　プロトタイプ宣言
*******************************************************************************/
void InitPlayer();
void UninitPlayer();
void UpdatePlayer();
void DrawPlayer();

void CreatePlayer();	//ピースブロックを作成
void MovePlayer();	//ピースの移動


#endif // !_PLAYER_H_

