/*******************************************************************************
* タイトル:		スコアアニメーション制御ヘッダー
* プログラム名:	score.h
* 作成者:		大槻海斗
* 作成日:		2024/06/24〜
* 更新日		2024/07/08
*******************************************************************************/

#ifndef _SCORE_H_
#define _SCORE_H_
/*******************************************************************************
*　インクルードファイル
*******************************************************************************/
#include "main.h"		//メインヘッダー

/*******************************************************************************
*　構造体宣言
*******************************************************************************/
class SCORE {		// スコアアニメーション構造体
private:

public:

	XMFLOAT3 pos;	// 座標
	XMFLOAT2 size;	// サイズ
	XMFLOAT4 color;	// 色
	int value;		// スコア
	bool use;		// 使用フラグ

	SCORE();
	~SCORE();
};

/*******************************************************************************
*　プロトタイプ宣言
*******************************************************************************/

void InitScore(void);
void UpdateScore(void);
void DrawScore(void);
void UninitScore(void);
void AddScore(int value);
int GetScore();


#endif
