/*******************************************************************************
* タイトル:		城壁描画
* プログラム名:	CreateField.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/21
********************************************************************************/
#define CONIOEX
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdio.h>		//標準入出力ヘッダー
#include "CreateField.h"//城壁作成ヘッダー
#include "main.h"		//メインヘッダー
#include "conioex.h"	//コンソール系ヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/


/*******************************************************************************
* フィールド作成関数
*******************************************************************************/
void CreateField(void)
{	//文字色を変える
	textcolor(DARKGRAY);
	
	//フィールドの左右に壁を作る
	for (int y = 1; y < FIELD_HEIGHT; y++)
	{
		gotoxy(1, y);
		printf("■");

		gotoxy((FIELD_WIDTH - 1) * 2 + 1, y);
		printf("■");
	}

	for (int x = 3; x < (FIELD_WIDTH - 1) * 2; x += 2)
	{
		gotoxy(x, 1);
		printf("■");

		gotoxy(x, FIELD_HEIGHT - 1);
		printf("■");
	}
	//文字色を戻す
	textcolor(WHITE);

}


//壁はx座標2〜33
