#pragma once
/*******************************************************************************
* 列挙体定義
*******************************************************************************/

//フェーズ
enum GamePhase
{
	PHASE1,
	PHASE_BOSS,
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

void GameInit(void);	//ゲームシーン初期化関数
void GameUninit(void);	//ゲームシーン終了処理関数
void GameUpdate(void);	//ゲームシーン更新処理関数
void GameDraw(void);	//ゲームシーン描画関数