/*******************************************************************************
* タイトル:		回復アイテムプログラム
* プログラム名:	ItemHeal.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/25
********************************************************************************/
#define CONIOEX
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "ItemHeal.h"	//回復アイテムヘッダー
#include "main.h"		//メインヘッダー
#include "conioex.h"	//コンソール系ヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/

ITEM IHeal[NUM_HEAL];	//アイテム用データ

/*******************************************************************************
* 回復アイテム初期化関数
*******************************************************************************/
void HealInit(void)
{
	for (int i = 0; i < NUM_HEAL; i++)
	{
		IHeal[i].posx = 0;
		IHeal[i].posy = 0;
		IHeal[i].pos_oldx = IHeal[i].posx;
		IHeal[i].pos_oldy = IHeal[i].posy;
		IHeal[i].speedx = 0.0f;
		IHeal[i].speedy = 0.02f;
		HealDelete(i);
	}
}

/*******************************************************************************
* 回復アイテム終了処理関数
*******************************************************************************/
void HealUninit(void)
{
	HealInit();
}

/*******************************************************************************
* 回復アイテム更新処理関数
*******************************************************************************/
void HealUpdate(void)
{
	for (int i = 0; i < NUM_HEAL; i++)
	{
		//前回値の保存
		IHeal[i].pos_oldx = IHeal[i].posx;
		IHeal[i].pos_oldy = IHeal[i].posy;

		//アイテムの座標更新
		if (IHeal[i].use == 1)
		{
			IHeal[i].posy += IHeal[i].speedy;
		}


	}
}

/*******************************************************************************
* 回復アイテム描画処理関数
*******************************************************************************/
void HealDraw(void)
{
	for (int i = 0; i < NUM_HEAL; i++)
	{
		if (IHeal[i].use == 1)
		{
			//下の壁よりアイテムの座標が大きくなった
			if (floatToInt(IHeal[i].posy) > SCREEN_BOTTOM)
			{
				HealDelete(i);	//壁に当たったのでアイテムを消す
			}
			else
			{
				//もし座標が更新されていたら描画を行う
				if ((floatToInt(IHeal[i].pos_oldx) != floatToInt(IHeal[i].posx)) ||
					(floatToInt(IHeal[i].pos_oldy) != floatToInt(IHeal[i].posy)))
				{
					//ひとつ前の場所
					gotoxy(floatToInt(IHeal[i].pos_oldx) * 2 + 1, floatToInt(IHeal[i].pos_oldy));
					printf("　");

					textcolor(LIGHTGREEN);

					//現在の場所
					gotoxy(floatToInt(IHeal[i].posx) * 2 + 1, floatToInt(IHeal[i].posy));
					printf("＋");

					textcolor(WHITE);
				}
			}
		}
	}
}

/*******************************************************************************
* 回復アイテム作成関数
*******************************************************************************/
void HealCreate(float x, float y)
{
	for (int i = 0; i < NUM_HEAL; i++)
	{
		//アイテムが使用中の場合は実行しない
		if (IHeal[i].use == 0)
		{
			IHeal[i].use = 1;							//弾のステータスを発射中に変更する
			IHeal[i].posx = floatToInt(x);	//プレイヤーのx座標を取得
			IHeal[i].posy = floatToInt(y);	//プレイヤーのy座標を取得

			textcolor(LIGHTGREEN);

			//現在の場所
			gotoxy(floatToInt(IHeal[i].posx) * 2 + 1, floatToInt(IHeal[i].posy));
			printf("＋");

			textcolor(WHITE);

			break;	//アイテムを作ったらループを抜ける
		}
	}
}

/*******************************************************************************
* 回復アイテム削除関数
*******************************************************************************/
void HealDelete(int id)
{
	//生存フラグをオフにする
	IHeal[id].use = 0;

	//ひとつ前の場所
	gotoxy(floatToInt(IHeal[id].pos_oldx) * 2 + 1, floatToInt(IHeal[id].pos_oldy));
	printf("　");
}


/*******************************************************************************
* 回復アイテムデータゲット関数
*******************************************************************************/
ITEM* GetHealItem()
{
	return IHeal;
}

