#pragma once
/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define NUM_HEAL (3)


/*******************************************************************************
* 構造体定義
*******************************************************************************/
struct ITEM
{
	float posx;//現在のX座標
	float posy;//現在のY座標
	float pos_oldx;	//前回のX座標
	float pos_oldy;	//前回のY座標

	float speedx;	//横への移動速度
	float speedy;	//縦への移動速度

	int use;//使用しているか使用していないかのフラグ
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void HealInit(void);
void HealUninit(void);
void HealUpdate(void);
void HealDraw(void);

void HealCreate(float x, float y);
void HealDelete(int id);

ITEM* GetHealItem();
