#pragma once

/*******************************************************************************
* マクロ定義
*******************************************************************************/
//フィールドの大きさを定義する
#define FIELD_WIDTH  (25 + 2)	//フィールドの幅を定義する
#define FIELD_HEIGHT (25 + 1)	//フィールドの高さを定義する

//画面の大きさを定義する
#define SCREEN_LEFT   (1)
#define SCREEN_TOP    (2)
#define SCREEN_RIGHT  (FIELD_WIDTH - 1)
#define SCREEN_BOTTOM (FIELD_HEIGHT - 3)

//ブロックの大きさを定義する
#define BLOCK_WIDTH_MAX  (3)//ブロックの形状の最大幅を定義する
#define BLOCK_HEIGHT_MAX (3)//ブロックの形状の最大高さを定義する

/*******************************************************************************
* 構造体定義
*******************************************************************************/

//ブロックの形状の構造体
struct BLOCKSHAPE {
	int width, height;	//幅と高さ
	int pattern[BLOCK_HEIGHT_MAX][BLOCK_WIDTH_MAX];//形状
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
int floatToInt(float f);
void SetClearFlag(int flag);
int GetClearFlag(void);
