#pragma once
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"		//メインヘッダー

/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define WAITING_TIME (20)		//プレイヤーが弾を撃てるまでのフレーム数

/*******************************************************************************
* 構造体定義
*******************************************************************************/

//プレイヤーデータ構造体
struct PLAYER
{
	float posx;		//現在のX座標
	float posy;		//現在のY座標
	float pos_oldx;	//前回のX座標
	float pos_oldy;	//前回のY座標

	float speedx;	//横への移動速度
	float speedy;	//縦への移動速度

	int MaxHP;		//最大ヒットポイント
	int HP;			//ヒットポイント

	int levelMax;	//プレイヤー最大レベル
	int level;		//プレイヤーレベル

	int fream;		//弾丸を撃てるまでの時間

	int Dmage_fream;//ダメージを受けた後の無敵時間

	int use;		//使用しているか使用していないかのフラグ
};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

void PlayerInit(void);		//プレイヤー初期化関数
void PlayerUninit(void);	//プレイヤー終了処理関数
void PlayerUpdate(void);	//プレイヤー更新関数
void PlayerDraw(void);		//プレイヤー描画関数
void PlayerDrawHP(void);	//プレイヤーHP描画関数
void PlayerDamage(void);	//プレイヤーダメージ計算関数

int PlayerGetHP(void);		//プレイヤーのHPを取得する関数
void PlayerHeal(void);		//プレイヤー回復関数

int PlayerGetLevel(void);	//プレイヤーのレベルを取得する関数
void PlayerLevelUp(void);	//プレイヤーのレベルアップ関数

PLAYER* GetPlayer();		//プレイヤー構造体を取得する関数
//プレイヤーの形状を取得する関数
const BLOCKSHAPE* GetPlayerShape(void);

void ReDrawPlayer(void);
