/*******************************************************************************
* タイトル:		弾丸プログラム
* プログラム名:	PlayerBullet1.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/22
********************************************************************************/
#define CONIOEX
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "PlayerBullet1.h"	//弾丸ヘッダー
#include "main.h"			//メインヘッダー
#include "conioex.h"		//コンソール系ヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/

BULLET PB1[NUM_BULLET];	//弾丸用データ

/*******************************************************************************
* 弾丸の初期化関数
*******************************************************************************/
void PlayerBullet1Init(void)
{
	for (int i = 0; i < NUM_BULLET; i++)
	{
		PB1[i].posx = 0;
		PB1[i].posy = 0;
		PB1[i].pos_oldx = PB1[i].posx;
		PB1[i].pos_oldy = PB1[i].posy;
		PB1[i].speedx = 0.0f;
		PB1[i].speedy = -0.5f;

		PlayerBullet1Delete(i);
	}
}

/*******************************************************************************
* 弾丸の終了処理関数
*******************************************************************************/
void PlayerBullet1Uninit(void)
{
	PlayerBullet1Init();
}

/*******************************************************************************
* 弾丸の更新処理関数
*******************************************************************************/
void PlayerBullet1Update(void)
{
	for (int i = 0; i < NUM_BULLET; i++)
	{
		//前回値の保存
		PB1[i].pos_oldx = PB1[i].posx;
		PB1[i].pos_oldy = PB1[i].posy;

		//弾の座標更新
		if (PB1[i].use == 2)
		{
			PB1[i].posy += PB1[i].speedy;
		}
	}
}

/*******************************************************************************
* 弾丸の描画処理関数
*******************************************************************************/
void PlayerBullet1Draw(void)
{
	for (int i = 0; i < NUM_BULLET; i++)
	{
		//1フレーム待つ
		if (PB1[i].use == 1)
		{
			PB1[i].use++;
		}
		//弾が発射中であれば描画を行う
		else if (PB1[i].use == 2)
		{
			//上の壁より弾の座標が小さくなった
			if (floatToInt(PB1[i].posy) < SCREEN_TOP)
			{
				PlayerBullet1Delete(i);	//壁に当たったので弾を消す
			}
			else
			{
				//もし座標が更新されていたら描画を行う
				if ((floatToInt(PB1[i].pos_oldx) != floatToInt(PB1[i].posx)) ||
					(floatToInt(PB1[i].pos_oldy) != floatToInt(PB1[i].posy)))
				{
					//ひとつ前の場所
					gotoxy(floatToInt(PB1[i].pos_oldx) * 2 + 1, floatToInt(PB1[i].pos_oldy));
					printf("　");

					textcolor(LIGHTCYAN);

					//現在の場所
					gotoxy(floatToInt(PB1[i].posx) * 2 + 1, floatToInt(PB1[i].posy));
					printf("○");

					textcolor(WHITE);
				}
			}
		}
	}
}

/*******************************************************************************
* 弾丸発射関数
*******************************************************************************/
void PlayerBullet1Shot(float player_x, float player_y)
{
	for (int i = 0; i < NUM_BULLET; i++)
	{
		//弾が使用中の場合は実行しない
		if (PB1[i].use == 0)
		{
			PB1[i].use = 1;							//弾のステータスを発射中に変更する
			PB1[i].posx = floatToInt(player_x) + 1;	//プレイヤーのx座標を取得
			PB1[i].posy = floatToInt(player_y) - 1;	//プレイヤーのy座標を取得

			textcolor(LIGHTCYAN);

			//現在の場所
			gotoxy(floatToInt(PB1[i].posx) * 2 + 1, floatToInt(PB1[i].posy));
			printf("○");

			textcolor(WHITE);

			break;	//弾を一発撃ったらループを抜ける
		}
	}
}

/*******************************************************************************
* 弾丸削除関数
*******************************************************************************/
void PlayerBullet1Delete(int index)
{
	//弾のステータスを未使用状態に更新する
	PB1[index].use = 0;

	//弾の表示を強制的に削除
	gotoxy(floatToInt(PB1[index].pos_oldx) * 2 + 1, floatToInt(PB1[index].pos_oldy));
	printf("　");
}

/*******************************************************************************
* 弾丸データゲット関数
*******************************************************************************/
BULLET* GetPlayerBullet1()
{
	return PB1;
}

