/*******************************************************************************
* タイトル:		プレイヤー弾丸プログラム
* プログラム名:	PlayerBullet.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/29
********************************************************************************/

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdlib.h>		//標準ライブラリヘッダー
#include "Player.h"		//プレイヤーヘッダー
#include "PlayerBullet1.h"	//レベル1弾丸ヘッダー
#include "PlayerBullet2.h"	//レベル2弾丸ヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/
int Level = PlayerGetLevel();

/*******************************************************************************
* 弾丸の初期化関数
*******************************************************************************/
void PBulletInit(void)
{
	Level = PlayerGetLevel();

	switch (Level)
	{
	case 1:
		PlayerBullet1Init();
		break;
	case 2:
		PlayerBullet2Init();
		break;
	}
}

/*******************************************************************************
* 弾丸の終了処理関数
*******************************************************************************/
void PBulletUninit(void)
{
	switch (Level)
	{
	case 1:
		PlayerBullet1Uninit();
		break;
	case 2:
		PlayerBullet2Uninit();
		break;
	}
}

/*******************************************************************************
* 弾丸の更新処理関数
*******************************************************************************/
void PBulletUpdate(void)
{
	switch (Level)
	{
	case 1:
		PlayerBullet1Update();
		break;
	case 2:
		PlayerBullet2Update();
		break;
	}
}

/*******************************************************************************
* 弾丸の描画処理関数
*******************************************************************************/
void PBulletDraw(void)
{
	switch (Level)
	{
	case 1:
		PlayerBullet1Draw();
		break;
	case 2:
		PlayerBullet2Draw();
		break;
	}
}

/*******************************************************************************
* 弾丸発射関数
*******************************************************************************/
void PBulletShot(float player_x, float player_y)
{
	switch (Level)
	{
	case 1:
		PlayerBullet1Shot(player_x, player_y);
		break;
	case 2:
		PlayerBullet2Shot(player_x, player_y);
		break;
	}
}

/*******************************************************************************
* 弾丸削除関数
*******************************************************************************/
void PBulletDelete(int index1, int index2)
{
	switch (Level)
	{
	case 1:
		PlayerBullet1Delete(index1);
		break;
	case 2:
		PlayerBullet2Delete(index1, index2);
		break;
	}
}

/*******************************************************************************
* プレイヤーレベル確認関数
*******************************************************************************/
void CheakLevel(void)
{
	if (Level != PlayerGetLevel())
	{
		PBulletUninit();

		PBulletInit();
	}
}