/*******************************************************************************
* タイトル:		リザルトシーンプログラム
* プログラム名:	Result.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/22
********************************************************************************/

//main.cpp以外のすべての.cppでconioexを使うときは#define CONIOEXを追加する
#define CONIOEX

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdio.h>		//標準入出力ヘッダー
#include "conioex.h"	//コンソール系ヘッダー
#include "Scene.h"		//シーン遷移ヘッダー
#include "main.h"		//メインヘッダー
#include "picture.h"	//アスキーアート出力ヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/
int ResultPicture = 1;	//リザルト画面を表示させるかどうか

int GameClearBGM;
int GameClearSE;
int GameOverBGM;
int ReStartSE;


/*******************************************************************************
* リザルトシーンの初期化関数
*******************************************************************************/
void ResultInit(void)
{
	ResultPicture = 1;	//リザルト画面を表示させる

	GameClearBGM = opensound((char*)"SIMPLE_BGM_06.mp3");
	GameClearSE = opensound((char*)"データ表示3.mp3");
	GameOverBGM = opensound((char*)"ゲームオーバー２.mp3");
	ReStartSE = opensound((char*)"ロボットを強く殴る1.mp3");

}

/*******************************************************************************
* リザルトシーンの終了処理関数
*******************************************************************************/
void ResultUninit(void)
{
	closesound(GameClearBGM);
	closesound(GameClearSE);
	closesound(GameOverBGM);
	closesound(ReStartSE);
}

/*******************************************************************************
* リザルトシーンの更新処理関数
*******************************************************************************/
void ResultUpdate(void)
{
	//Rボタンが押されたら
	if (inport(PK_R))
	{
		playsound(ReStartSE, 0);

		Sleep(1000);

		//シーンをタイトル画面へ切り替える
		SetScene(SCENE_TITLE);
	}

	//バックスペースキーが押されたら
	if (inport(PK_BS))
	{
		exit(-1);
	}
}

/*******************************************************************************
* リザルトシーンの描画関数
*******************************************************************************/
void ResultDraw(void)
{
	if (ResultPicture == 1)
	{
		gotoxy(1, 1);

		if (GetClearFlag() == 1)
		{
			playsound(GameOverBGM, 1);

			GameOver();	//ゲームオーバー画面

		}
		else
		{
			playsound(GameClearBGM, 1);

			GameClear();//ゲームクリア画面
		}

		ResultPicture--;
	}

}
