/*******************************************************************************
* タイトル:		シーンプログラム
* プログラム名:	Scene.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/22
********************************************************************************/


/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "Scene.h"		//シーン遷移ヘッダー
#include "Title.h"		//タイトルシーンヘッダー
#include "Game.h"		//ゲームシーンヘッダー
#include "Result.h"		//リザルトシーンヘッダー
#include <stdlib.h>		//標準ライブラリヘッダー
#include <Windows.h>	//Windowsヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/

//始めたいシーンで初期化しておく
SCENE g_Scene = SCENE_TITLE;		//現在動作中のシーン
SCENE g_SceneNext = SCENE_TITLE;	//移行先シーン

//ゲームグローバルデータ
int g_Score;		//点数
DWORD g_Time;		//タイマーデータ
DWORD g_ClearTime;	//クリアタイム


/*******************************************************************************
* シーンの初期化関数
*******************************************************************************/
void SceneInit(void)
{
	switch (g_Scene)
	{
	case SCENE_TITLE:
		//タイトル画面の初期化
		TitleInit();
		break;
	case SCENE_GAME:
		//ゲーム本編の初期化
		GameInit();
		break;
	case SCENE_RESULT:
		//結果表示の初期化
		ResultInit();
		break;
	}
}

/*******************************************************************************
* シーンの終了処理関数
*******************************************************************************/
void SceneUninit(void)
{
	switch (g_Scene)
	{
	case SCENE_TITLE:
		//タイトル画面の終了処理
		TitleUninit();
		break;
	case SCENE_GAME:
		//ゲーム本編の終了処理
		GameUninit();
		break;
	case SCENE_RESULT:
		//結果表示の終了処理
		ResultUninit();
		break;
	}
}

/*******************************************************************************
* シーンの更新処理関数
*******************************************************************************/
void SceneUpdate(void)
{
	switch (g_Scene)
	{
	case SCENE_TITLE:
		//タイトル画面の更新処理
		TitleUpdate();
		break;
	case SCENE_GAME:
		//ゲーム本編の更新処理
		GameUpdate();
		break;
	case SCENE_RESULT:
		//結果表示の更新処理
		ResultUpdate();
		break;
	}
}

/*******************************************************************************
* シーンの描画処理関数
*******************************************************************************/
void SceneDraw(void)
{
	switch (g_Scene)
	{
	case SCENE_TITLE:
		//タイトル画面の描画処理
		TitleDraw();
		break;
	case SCENE_GAME:
		//ゲーム本編の描画処理
		GameDraw();
		break;
	case SCENE_RESULT:
		//結果表示の描画処理
		ResultDraw();
		break;
	}
}

/*******************************************************************************
* 遷移先シーンのセット関数
*******************************************************************************/
void SetScene(SCENE next)
{
	g_SceneNext = next;
}

/*******************************************************************************
* 遷移先のシーンがセットされているか確認する関数
*******************************************************************************/
void CheckScene(void)
{
	//現在動作しているシーンと移行先シーンが違っているか、をチェックする
	if (g_Scene != g_SceneNext)
	{
		//現在動作中のシーンを終了させる
		SceneUninit();

		//現在のシーンを移行先シーンで更新する
		g_Scene = g_SceneNext;

		//画面のクリア
		system("cls");

		//移行先シーンを初期化する
		SceneInit();
	}
}

/*******************************************************************************
* 点数の初期化関数
*******************************************************************************/
void ResetScore(void)
{
	g_Score = 0;
}

/*******************************************************************************
* te点数計算関数数
*******************************************************************************/
void AddScore(int point)
{
	g_Score += point;
}

/*******************************************************************************
* 点数取得関数関数
*******************************************************************************/
int GetScore(void)
{
	return g_Score;
}

/*******************************************************************************
* タイマースタート関数関数
*******************************************************************************/
void StartTimer(void)
{
	g_Time = timeGetTime();
}

/*******************************************************************************
* タイマー計算関数関数
*******************************************************************************/
DWORD ElapsedTime(void)
{
	DWORD currentTime = timeGetTime();	//現在時刻

	return(currentTime - g_Time);//現在時刻　- 開始時間 →　経過時間
}