#pragma once

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <Windows.h>	//Windowsヘッダー

/*******************************************************************************
* 列挙体定義
*******************************************************************************/

//シーン
enum SCENE
{
	SCENE_TITLE,	//タイトル画面
	SCENE_GAME,		//ゲーム本編
	SCENE_RESULT,	//リザルト表示

};

/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

void SceneInit(void);		//シーン初期化関数
void SceneUninit(void);		//シーン終了関数
void SceneUpdate(void);		//シーン更新関数
void SceneDraw(void);		//シーン描画関数

void SetScene(SCENE next);	//シーン遷移関数
void CheckScene(void);		//次のシーンがセットされているか確認する関数

void ResetScore(void);		//点数の初期化関数
void AddScore(int point);	//点数計算関数
int GetScore(void);			//点数取得関数

void StartTimer(void);		//タイマースタート関数
DWORD ElapsedTime(void);	//時間計算関数