/*******************************************************************************
* タイトル:		タイトルシーンプログラム
* プログラム名:	Title.cpp
* 作成者:		大槻海斗
* 作成日:		2024/02/22
********************************************************************************/

//main.cpp以外のすべての.cppでconioexを使うときは#define CONIOEXを追加する
#define CONIOEX

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include <stdio.h>
#include "conioex.h"	//コンソール系ヘッダー
#include "Scene.h"		//シーン遷移ヘッダー
#include "picture.h"	//アスキーアート出力ヘッダー

/*******************************************************************************
* グローバル変数
*******************************************************************************/
int TitlePicture = 1;	//タイトル画面を表示させるかどうか
int BGM;
int SE;

/*******************************************************************************
* タイトルシーンの初期化関数
*******************************************************************************/
void TitleInit(void)
{
	TitlePicture = 1;	//タイトル画面を表示させる

	BGM = opensound((char*)"Appareil.mp3");

	SE = opensound((char*)"決定ボタンを押す31.mp3");

	//タイトル用BGM　ループ
	playsound(BGM, 1);
}

/*******************************************************************************
* タイトルシーン終了処理関数
*******************************************************************************/
void TitleUninit(void)
{
	//BGM用データを解放する
	closesound(BGM);

	//スタート用SEを開放する
	closesound(SE);

}

/*******************************************************************************
* タイトルシーン更新処理関数
*******************************************************************************/
void TitleUpdate(void)
{
	//エンターキーが押されたら
	if (inport(PK_ENTER))
	{
		playsound(SE, 0);

		//3,2,1,Start　のカウントダウン
		CountDown();

		//シーンをゲーム本編へ切り替える
		SetScene(SCENE_GAME);
	}
}

/*******************************************************************************
* タイトルシーン描画処理関数
*******************************************************************************/
void TitleDraw(void)
{
	if (TitlePicture == 1)
	{
		gotoxy(1, 1);

		//タイトル画面を標示
		GameTitle();

		TitlePicture--;
	}
}